backend/app/validators/order_validator.rb

SELECT "tokens".* FROM "tokens" WHERE "tokens"."ticker" = $1 LIMIT $2  [["ticker", "usd"], ["LIMIT", 1]]
SELECT "balances".* FROM "balances" WHERE "balances"."user_id" = $1 AND "balances"."token_id" = $2  [["user_id", 37], ["token_id", 1]]
SELECT "balances".* FROM "balances" WHERE "balances"."user_id" = $1 AND "balances"."token_id" = $2  [["user_id", 6], ["token_id", 15]]
SELECT "balances".* FROM "balances" WHERE "balances"."user_id" = $1 AND "balances"."token_id" = $2  [["user_id", 1], ["token_id", 1]]
UPDATE "balances" SET "balance" = $1, "updated_at" = $2 WHERE "balances"."id" = $3  [["balance", 0.0], ["updated_at", "2021-12-17 20:46:40.002178"], ["id", 37]]
UPDATE "balances" SET "balance" = $1, "updated_at" = $2 WHERE "balances"."id" = $3  [["balance", 198.5], ["updated_at", "2021-12-16 23:49:28.252600"], ["id", 16]]
---
    def helper order, user, token
      price = {
        "btc" => 50000.0,
        "eth" => 4000.0,
        "doge" => 0.15,
        "bnb" => 500,
        "usdt" => 1
      }

      if !order.sell
        @usd = Token.find_by(ticker: "usd")
        @bals = Balance.where(user_id: user.id, token_id: @usd.id)
        @amount = order.amount * price[token.ticker]
      else
        @amount = order.amount
        @bals = Balance.where(user_id: user.id, token_id: token.id)
      end

      @total = 0;
      @bals.each { | bal | @total += bal.balance }

      if @total < @amount
        return false
      else
        @bals.each do | bal |
          if bal.balance <= @amount && @amount != 0
            @amount -= bal.balance
            bal.update(balance: 0)
          elsif bal.balance >= @amount && @amount != 0
            bal.update(balance: bal.balance - @amount)