backend/app/models/balance.rb

DELETE FROM "balances" WHERE "balances"."id" = $1  [["id", 2]]
---
  def check_balance
    if self.balance <= 0
      self.destroy