backend/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Larry"], ["LIMIT", 1]]
---
  def self.find_by_any_params params
    params.match(/\D/) ? self.find_by_name(params) : self.find(params)