backend/app/controllers/balances_controller.rb

  def index
    @balances = Balance.all
---
SELECT "balances".* FROM "balances"

  def create
    @balance = Balance.exists params.require(:balance).permit(:user_id, :token_id)

    if @balance
      @balance.update(balance: @balance.balance + params.require(:balance).permit(:balance)[:balance].to_f)
    else
      @balance = Balance.create(balance_params)
---
SELECT "balances".* FROM "balances" WHERE "balances"."user_id" = $1 AND "balances"."token_id" = $2  [["user_id", 6], ["token_id", 1]]
UPDATE "balances" SET "balance" = $1, "updated_at" = $2 WHERE "balances"."id" = $3  [["balance", 321.0], ["updated_at", "2021-12-17 00:37:52.656224"], ["id", 3]]
INSERT INTO "balances" ("user_id", "token_id", "balance", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5], ["token_id", 1], ["balance", 1233.0], ["created_at", "2021-12-17 00:30:50.067507"], ["updated_at", "2021-12-17 00:30:50.067507"]]