backend/app/controllers/orders_controller.rb

SELECT "tokens".* FROM "tokens" WHERE "tokens"."ticker" = $1 LIMIT $2  [["ticker", "btc"], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "token_id", "amount", "sell", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["token_id", 1], ["amount", 23.0], ["sell", true], ["created_at", "2021-12-16 18:11:45.795581"], ["updated_at", "2021-12-16 18:11:45.795581"]]
---
  def create
    @token = Token.find_by(params.require(:order).permit(:ticker))
    params[:order][:token_id] = @token.id
    @order = Order.create(order_params)