backend/app/controllers/tokens_controller.rb

  def index
    @tokens = Token.all
---
SELECT "tokens".* FROM "tokens"

    def set_token
      @token = Token.find(params[:id])
---
SELECT "tokens".* FROM "tokens" WHERE "tokens"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]