backend/app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "ayuh"], ["email", "email@email.com"], ["created_at", "2021-12-17 00:08:03.078413"], ["updated_at", "2021-12-17 00:08:03.078413"]]

  def update
    @user = User.update(user_params)
---
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Larry3"], ["email", "email@email.com"], ["updated_at", "2021-12-17 18:19:37.394207"], ["id", 1]]